; domain
(define (domain orbital)

    (:requirements :typing :fluents)

    (:types
        module - object
    )

    (:predicates
        (linked ?f1 - module ?f2 - module)
    )

    (:functions
        (oxygen ?b - module)
        (power_drain)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action vent-fast
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 4) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 4) (increase (oxygen ?f2) 2) (increase (power_drain) 1))
    )

    (:action vent-slow
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 1) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 1) (increase (oxygen ?f2) 1))
    )

)

; problem
(define (problem orbital-p02)
  (:domain orbital)
  (:objects
    module0 module1 module2 module3 - module
  )
  (:init
    (= (power_drain) 0)
    (= (oxygen module0) 8)
    (= (oxygen module1) 0)
    (= (oxygen module2) 0)
    (= (oxygen module3) 0)
    (linked module0 module1)
    (linked module1 module0)
    (linked module1 module2)
    (linked module2 module1)
    (linked module2 module3)
    (linked module3 module2)
  )
  (:goal
    (and
      (>= (oxygen module1) 1)
      (>= (oxygen module2) 1)
      (>= (oxygen module3) 1)
    )
  )
)

; plan
1. (vent-slow module0 module1)
   changed: (oxygen module0) from 8 to 7, (oxygen module1) from 0 to 1
   goals met: 1 of 3
2. (vent-slow module1 module2)
   changed: (oxygen module1) from 1 to 0, (oxygen module2) from 0 to 1
   goals met: 1 of 3
3. (vent-slow module0 module1)
   changed: (oxygen module0) from 7 to 6, (oxygen module1) from 0 to 1
   goals met: 2 of 3
4. (vent-slow module2 module3)
   changed: (oxygen module2) from 1 to 0, (oxygen module3) from 0 to 1
   goals met: 2 of 3
5. (vent-slow module1 module2)
   changed: (oxygen module1) from 1 to 0, (oxygen module2) from 0 to 1
   goals met: 2 of 3
6. (vent-slow module0 module1)
   changed: (oxygen module0) from 6 to 5, (oxygen module1) from 0 to 1
   goals met: 3 of 3
